app/views/urls/show.html.erb

  <p>Short URL :: <a href="https://<%= @original_url %>"><%= @short_url%></a></p>
  <p>Url clicks count :: <%= Url.count %>
---
SELECT COUNT(*) FROM "urls"