app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @url = Url.find(params[:id])

INSERT INTO "urls" ("original_url", "short_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["original_url", "guides.rubyonrails.org/getting_started.html"], ["short_url", "umpop"], ["created_at", "2021-06-21 13:50:15.418887"], ["updated_at", "2021-06-21 13:50:15.418887"]]
---
  def create
    @url = Url.new(link_params)
    @url.short_url = @url.generate_short_url
    @url.original_url = @url.sanitize
    if @url.save